In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
# from xgboost import XGBRegressor
import seaborn as sns

In [5]:
X = pd.read_csv("Data/train (15).csv")
y = pd.read_csv("Data/test (15).csv")

,MatchId,LeagueId,Date,HomeTeamId,AwayTeamId,Home_Goals,Away_Goals,Home_Corners,Away_Corners
0,2826,793,02/04/2005,410,908,2.0,0.0,15,1
1,2827,793,02/04/2005,338,597,3.0,2.0,3,6
2,2828,793,02/04/2005,1364,246,2.0,3.0,13,2
3,2829,793,02/04/2005,1088,1397,1.0,0.0,2,5
4,2830,793,02/04/2005,830,1412,2.0,3.0,3,6
...,...,...,...,...,...,...,...,...,...
23825,307623,800,18/12/2010,1326,1399,1.0,0.0,4,5
23826,307624,800,18/12/2010,944,8291,2.0,1.0,3,4
23827,307625,800,18/12/2010,4704,4705,4.0,0.0,4,4
23828,307626,800,18/12/2010,2113,250,1.0,1.0,5,5
23829,307617,800,19/12/2010,907,1827,1.0,0.0,6,4

In [7]:
y

,MatchId,LeagueId,Date,HomeTeamId,AwayTeamId,Line,Over,Under,Unnamed: 8,P(Under),P(At),P(Over),Bet (U/O),Stake
0,1,741,01/04/2011,342,694,9.5,1.790,1.800,NaN,NaN,NaN,NaN,NaN,NaN
1,2,741,01/04/2011,1424,270,11.5,1.920,2.000,NaN,NaN,NaN,NaN,NaN,NaN
2,3,729,01/04/2011,691,1137,10.5,1.970,1.870,NaN,NaN,NaN,NaN,NaN,NaN
3,4,729,01/04/2011,787,808,11.0,2.075,1.770,NaN,NaN,NaN,NaN,NaN,NaN
4,5,741,01/04/2011,784,1117,12.0,2.020,1.860,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336,337,729,22/05/2011,1211,1118,10.5,1.950,1.961,NaN,NaN,NaN,NaN,NaN,NaN
337,338,795,22/05/2011,1116,876,10.0,1.920,1.909,NaN,NaN,NaN,NaN,NaN,NaN
338,339,801,22/05/2011,1223,771,10.0,2.020,1.840,NaN,NaN,NaN,NaN,NaN,NaN
339,340,801,22/05/2011,238,570,10.5,2.020,1.900,NaN,NaN,NaN,NaN,NaN,NaN
340,341,776,23/05/2011,412,1089,10.5,2.220,1.729,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
X.columns

Index(['MatchId', 'LeagueId', 'Date', 'HomeTeamId', 'AwayTeamId', 'Home_Goals',
       'Away_Goals', 'Home_Corners', 'Away_Corners'],
      dtype='object')

In [9]:
y.columns

Index(['MatchId', 'LeagueId', 'Date', 'HomeTeamId', 'AwayTeamId', 'Line',
       'Over', 'Under', 'Unnamed: 8', 'P(Under)', 'P(At)', 'P(Over)',
       'Bet (U/O)', 'Stake'],
      dtype='object')

In [13]:
y.Date.value_counts()

01/04/2011    28
14/05/2011    28
09/04/2011    25
21/05/2011    24
30/04/2011    23
17/04/2011    20
22/05/2011    19
08/05/2011    18
16/04/2011    18
07/05/2011    16
10/04/2011    14
06/04/2011    13
15/05/2011    12
01/05/2011    12
11/05/2011     9
07/04/2011     9
13/05/2011     7
20/05/2011     7
08/04/2011     6
29/04/2011     6
15/04/2011     5
06/05/2011     5
05/04/2011     4
10/05/2011     2
12/04/2011     2
11/04/2011     2
16/05/2011     2
02/05/2011     2
09/05/2011     1
04/04/2011     1
23/05/2011     1
Name: Date, dtype: int64